BsAtHome/atpack/Atmel.ATmega_DFP.atpack/edc/ATmega406.PIC
        <edc:AdjustPoint edc:_addr="0x82" edc:offset="0x2"/>
        <edc:SFRDef edc:_addr="0x84" edc:access="nnnnnnnnnnnnnnnn" edc:cname="TCNT1" edc:nzwidth="0x10" ltx:memberofperipheral="TC1"/>
        <edc:AdjustPoint edc:_addr="0x86" edc:offset="0x2"/>
        <edc:SFRDef edc:_addr="0x88" edc:access="nnnnnnnn" edc:cname="OCR1AL" edc:nzwidth="0x8" ltx:memberofperipheral="TC1"/>
        <edc:SFRDef edc:_addr="0x89" edc:access="nnnnnnnn" edc:cname="OCR1AH" edc:nzwidth="0x8" ltx:memberofperipheral="TC1"/>
        <edc:AdjustPoint edc:_addr="0x8A" edc:offset="0x2E"/>
        <edc:SFRDef edc:_addr="0xB8" edc:access="nnnnnnnn" edc:cname="TWBR" edc:nzwidth="0x8" ltx:memberofperipheral="TWI"/>
        <edc:SFRDef edc:_addr="0xB9" edc:access="nnnnn-nn" edc:cname="TWSR" edc:nzwidth="0x8" ltx:memberofperipheral="TWI">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TWPS" edc:desc="TWI Prescaler" edc:nzwidth="0x2">
                <edc:SFRFieldSemantic edc:cname="VAL_0x00" edc:desc="1" edc:when="(field &amp; 0x3) == 0x00"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x01" edc:desc="4" edc:when="(field &amp; 0x3) == 0x01"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x02" edc:desc="16" edc:when="(field &amp; 0x3) == 0x02"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x03" edc:desc="64" edc:when="(field &amp; 0x3) == 0x03"/>
              </edc:SFRFieldDef>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="TWS" edc:desc="TWI Status" edc:nzwidth="0x5"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xBA" edc:access="nnnnnnnn" edc:cname="TWAR" edc:nzwidth="0x8" ltx:memberofperipheral="TWI">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TWGCE" edc:desc="TWI General Call Recognition Enable Bit" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TWA" edc:desc="TWI (Slave) Address register Bits" edc:nzwidth="0x7"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xBB" edc:access="nnnnnnnn" edc:cname="TWDR" edc:nzwidth="0x8" ltx:memberofperipheral="TWI"/>
        <edc:SFRDef edc:_addr="0xBC" edc:access="nnnnnn-n" edc:cname="TWCR" edc:nzwidth="0x8" ltx:memberofperipheral="TWI">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TWIE" edc:desc="TWI Interrupt Enable" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="TWEN" edc:desc="TWI Enable Bit" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TWWC" edc:desc="TWI Write Collition Flag" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TWSTO" edc:desc="TWI Stop Condition Bit" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TWSTA" edc:desc="TWI Start Condition Bit" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TWEA" edc:desc="TWI Enable Acknowledge Bit" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TWINT" edc:desc="TWI Interrupt Flag" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xBD" edc:access="nnnnnnn-" edc:cname="TWAMR" edc:nzwidth="0x8" ltx:memberofperipheral="TWI">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="TWAM" edc:nzwidth="0x7"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xBE" edc:access="nn---nnn" edc:cname="TWBCSR" edc:nzwidth="0x8" ltx:memberofperipheral="TWI">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TWBCIP" edc:desc="TWI Bus Connect/Disconnect Interrupt Polarity" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TWBDT" edc:desc="TWI Bus Disconnect Time-out Period" edc:nzwidth="0x2">
                <edc:SFRFieldSemantic edc:cname="VAL_0x00" edc:desc="250ms" edc:when="(field &amp; 0x3) == 0x00"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x01" edc:desc="500ms" edc:when="(field &amp; 0x3) == 0x01"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x02" edc:desc="1000ms" edc:when="(field &amp; 0x3) == 0x02"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x03" edc:desc="2000ms" edc:when="(field &amp; 0x3) == 0x03"/>
              </edc:SFRFieldDef>
              <edc:AdjustPoint edc:offset="0x3"/>
              <edc:SFRFieldDef edc:cname="TWBCIE" edc:desc="TWI Bus Connect/Disconnect Interrupt Enable" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TWBCIF" edc:desc="TWI Bus Connect/Disconnect Interrupt Flag" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:_addr="0xBF" edc:offset="0x1"/>
        <edc:SFRDef edc:_addr="0xC0" edc:access="------nn" edc:cname="CCSR" edc:nzwidth="0x8" ltx:memberofperipheral="CPU">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ACS" edc:desc="Asynchronous Clock Select" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="XOE" edc:desc="32 kHz Crystal Oscillator Enable" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:_addr="0xC1" edc:offset="0xF"/>
        <edc:SFRDef edc:_addr="0xD0" edc:access="n-nnnnnn" edc:cname="BGCCR" edc:nzwidth="0x8" ltx:memberofperipheral="BANDGAP">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="BGCC" edc:desc="BG Calibration of PTAT Current Bits" edc:nzwidth="0x6"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="BGD" edc:desc="Setting the BGD bit to one will disable the bandgap voltage reference. This bit must be cleared before enabling CC-ADC or V-ADC, and must remain unset while either ADC is enabled." edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
