BsAtHome/atpack/Atmel.ATmega_DFP.atpack/edc/ATmega406.PIC
        <edc:SFRDef edc:_addr="0xD1" edc:access="nnnnnnnn" edc:cname="BGCRR" edc:nzwidth="0x8" ltx:memberofperipheral="BANDGAP"/>
        <edc:AdjustPoint edc:_addr="0xD2" edc:offset="0xE"/>
        <edc:SFRDef edc:_addr="0xE0" edc:access="nnnnnnnn" edc:cname="CADAC0" edc:nzwidth="0x8" ltx:memberofperipheral="COULOMB_COUNTER"/>
        <edc:SFRDef edc:_addr="0xE1" edc:access="nnnnnnnn" edc:cname="CADAC1" edc:nzwidth="0x8" ltx:memberofperipheral="COULOMB_COUNTER"/>
        <edc:SFRDef edc:_addr="0xE2" edc:access="nnnnnnnn" edc:cname="CADAC2" edc:nzwidth="0x8" ltx:memberofperipheral="COULOMB_COUNTER"/>
        <edc:SFRDef edc:_addr="0xE3" edc:access="nnnnnnnn" edc:cname="CADAC3" edc:nzwidth="0x8" ltx:memberofperipheral="COULOMB_COUNTER"/>
        <edc:SFRDef edc:_addr="0xE4" edc:access="n-nnnnnn" edc:cname="CADCSRA" edc:nzwidth="0x8" ltx:memberofperipheral="COULOMB_COUNTER">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CADSE" edc:desc="When the CADSE bit is written to one, the ongoing CC-ADC conversion is aborted, and the CC-ADC enters Regular Current detection mode." edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CADSI" edc:desc="The CADSI bits determine the current sampling interval for the Regular Current detection in Power-down mode. The actual settings remain to be determined." edc:nzwidth="0x2">
                <edc:SFRFieldSemantic edc:cname="VAL_0x00" edc:desc="125ms" edc:when="(field &amp; 0x3) == 0x00"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x01" edc:desc="250ms" edc:when="(field &amp; 0x3) == 0x01"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x02" edc:desc="500ms" edc:when="(field &amp; 0x3) == 0x02"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x03" edc:desc="1000ms" edc:when="(field &amp; 0x3) == 0x03"/>
              </edc:SFRFieldDef>
              <edc:SFRFieldDef edc:cname="CADAS" edc:desc="CC_ADC Accumulate Current Select Bits" edc:nzwidth="0x2">
                <edc:SFRFieldSemantic edc:cname="VAL_0x00" edc:desc="125ms" edc:when="(field &amp; 0x3) == 0x00"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x01" edc:desc="250ms" edc:when="(field &amp; 0x3) == 0x01"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x02" edc:desc="500ms" edc:when="(field &amp; 0x3) == 0x02"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x03" edc:desc="1000ms" edc:when="(field &amp; 0x3) == 0x03"/>
              </edc:SFRFieldDef>
              <edc:SFRFieldDef edc:cname="CADUB" edc:desc="CC_ADC Update Busy" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="CADEN" edc:desc="When the CADEN bit is cleared (zero), the CC-ADC is disabled. When the CADEN bit is set (one), the CC-ADC will continuously measure the voltage drop over the external sense resistor RSENSE. In Power-down, only the Regular Current detection is active. In Power-off, the CC-ADC is always disabled." edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xE5" edc:access="-nnn-nnn" edc:cname="CADCSRB" edc:nzwidth="0x8" ltx:memberofperipheral="COULOMB_COUNTER">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CADICIF" edc:desc="CC-ADC Instantaneous Current Interrupt Flag" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CADRCIF" edc:desc="CC-ADC Accumulate Current Interrupt Flag" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CADACIF" edc:desc="CC-ADC Accumulate Current Interrupt Flag" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="CADICIE" edc:desc="CAD Instantenous Current Interrupt Enable" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CADRCIE" edc:desc="Regular Current Interrupt Enable" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CADACIE" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xE6" edc:access="nnnnnnnn" edc:cname="CADRCC" edc:nzwidth="0x8" ltx:memberofperipheral="COULOMB_COUNTER"/>
        <edc:SFRDef edc:_addr="0xE7" edc:access="nnnnnnnn" edc:cname="CADRDC" edc:nzwidth="0x8" ltx:memberofperipheral="COULOMB_COUNTER"/>
        <edc:SFRDef edc:_addr="0xE8" edc:access="nnnnnnnnnnnnnnnn" edc:cname="CADIC" edc:nzwidth="0x10" ltx:memberofperipheral="COULOMB_COUNTER"/>
        <edc:AdjustPoint edc:_addr="0xEA" edc:offset="0x6"/>
        <edc:SFRDef edc:_addr="0xF0" edc:access="--nnnnnn" edc:cname="FCSR" edc:nzwidth="0x8" ltx:memberofperipheral="FET">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PFD" edc:desc="Precharge FET disable" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CFE" edc:desc="Charge FET Enable" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DFE" edc:desc="Discharge FET Enable" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CPS" edc:desc="Current Protection Status" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PWMOPC" edc:desc="Pulse Width Modulation Modulation of OPC output" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PWMOC" edc:desc="Pulse Width Modulation of OC output" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xF1" edc:access="----nnnn" edc:cname="CBCR" edc:nzwidth="0x8" ltx:memberofperipheral="CELL_BALANCING">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CBE" edc:desc="Cell Balancing Enables" edc:nzwidth="0x4"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xF2" edc:access="nnnnnnnn" edc:cname="BPIR" edc:nzwidth="0x8" ltx:memberofperipheral="BATTERY_PROTECTION">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SCIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DOCIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="COCIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DUVIE" edc:desc="Deep Under-voltage Early Warning Interrupt Enable" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SCIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DOCIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="COCIF" edc:desc="Charge Over-current Protection Activated Interrupt Flag" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DUVIF" edc:desc="Deep Under-voltage Early Warning Interrupt Flag" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xF3" edc:access="--nnnnnn" edc:cname="BPDUV" edc:nzwidth="0x8" ltx:memberofperipheral="BATTERY_PROTECTION">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="DUDL" edc:nzwidth="0x4">
                <edc:SFRFieldSemantic edc:cname="VAL_0x00" edc:desc="4.71V" edc:when="(field &amp; 0xF) == 0x00"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x01" edc:desc="5.03V" edc:when="(field &amp; 0xF) == 0x01"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x02" edc:desc="5.34V" edc:when="(field &amp; 0xF) == 0x02"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x03" edc:desc="5.66V" edc:when="(field &amp; 0xF) == 0x03"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x04" edc:desc="5.97V" edc:when="(field &amp; 0xF) == 0x04"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x05" edc:desc="6.29V" edc:when="(field &amp; 0xF) == 0x05"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x06" edc:desc="6.60V" edc:when="(field &amp; 0xF) == 0x06"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x07" edc:desc="6.91V" edc:when="(field &amp; 0xF) == 0x07"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x08" edc:desc="7.23V" edc:when="(field &amp; 0xF) == 0x08"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x09" edc:desc="7.54V" edc:when="(field &amp; 0xF) == 0x09"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x0A" edc:desc="7.86V" edc:when="(field &amp; 0xF) == 0x0A"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x0B" edc:desc="8.17V" edc:when="(field &amp; 0xF) == 0x0B"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x0C" edc:desc="8.49V" edc:when="(field &amp; 0xF) == 0x0C"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x0D" edc:desc="8.80V" edc:when="(field &amp; 0xF) == 0x0D"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x0E" edc:desc="9.11V" edc:when="(field &amp; 0xF) == 0x0E"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x0F" edc:desc="9.43V" edc:when="(field &amp; 0xF) == 0x0F"/>
              </edc:SFRFieldDef>
              <edc:SFRFieldDef edc:cname="DUVT" edc:nzwidth="0x2">
                <edc:SFRFieldSemantic edc:cname="VAL_0x00" edc:desc="750ms" edc:when="(field &amp; 0x3) == 0x00"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x01" edc:desc="1000ms" edc:when="(field &amp; 0x3) == 0x01"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x02" edc:desc="1250ms" edc:when="(field &amp; 0x3) == 0x02"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x03" edc:desc="1500ms" edc:when="(field &amp; 0x3) == 0x03"/>
              </edc:SFRFieldDef>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xF4" edc:access="----nnnn" edc:cname="BPSCD" edc:nzwidth="0x8" ltx:memberofperipheral="BATTERY_PROTECTION">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SCDL" edc:nzwidth="0x4">
                <edc:SFRFieldSemantic edc:cname="VAL_0x00" edc:desc="0.100V" edc:when="(field &amp; 0xF) == 0x00"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x01" edc:desc="0.110V" edc:when="(field &amp; 0xF) == 0x01"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x02" edc:desc="0.120V" edc:when="(field &amp; 0xF) == 0x02"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x03" edc:desc="0.130V" edc:when="(field &amp; 0xF) == 0x03"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x04" edc:desc="0.140V" edc:when="(field &amp; 0xF) == 0x04"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x05" edc:desc="0.160V" edc:when="(field &amp; 0xF) == 0x05"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x06" edc:desc="0.180V" edc:when="(field &amp; 0xF) == 0x06"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x07" edc:desc="0.200V" edc:when="(field &amp; 0xF) == 0x07"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x08" edc:desc="0.220V" edc:when="(field &amp; 0xF) == 0x08"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x09" edc:desc="0.240V" edc:when="(field &amp; 0xF) == 0x09"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x0A" edc:desc="0.260V" edc:when="(field &amp; 0xF) == 0x0A"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x0B" edc:desc="0.280V" edc:when="(field &amp; 0xF) == 0x0B"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x0C" edc:desc="0.320V" edc:when="(field &amp; 0xF) == 0x0C"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x0D" edc:desc="0.360V" edc:when="(field &amp; 0xF) == 0x0D"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x0E" edc:desc="0.400V" edc:when="(field &amp; 0xF) == 0x0E"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x0F" edc:desc="0.440V" edc:when="(field &amp; 0xF) == 0x0F"/>
              </edc:SFRFieldDef>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xF5" edc:access="nnnnnnnn" edc:cname="BPOCD" edc:nzwidth="0x8" ltx:memberofperipheral="BATTERY_PROTECTION">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CCDL" edc:nzwidth="0x4">
                <edc:SFRFieldSemantic edc:cname="VAL_0x00" edc:desc="0.050V" edc:when="(field &amp; 0xF) == 0x00"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x01" edc:desc="0.055V" edc:when="(field &amp; 0xF) == 0x01"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x02" edc:desc="0.060V" edc:when="(field &amp; 0xF) == 0x02"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x03" edc:desc="0.065V" edc:when="(field &amp; 0xF) == 0x03"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x04" edc:desc="0.070V" edc:when="(field &amp; 0xF) == 0x04"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x05" edc:desc="0.080V" edc:when="(field &amp; 0xF) == 0x05"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x06" edc:desc="0.090V" edc:when="(field &amp; 0xF) == 0x06"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x07" edc:desc="0.100V" edc:when="(field &amp; 0xF) == 0x07"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x08" edc:desc="0.110V" edc:when="(field &amp; 0xF) == 0x08"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x09" edc:desc="0.120V" edc:when="(field &amp; 0xF) == 0x09"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x0A" edc:desc="0.130V" edc:when="(field &amp; 0xF) == 0x0A"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x0B" edc:desc="0.140V" edc:when="(field &amp; 0xF) == 0x0B"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x0C" edc:desc="0.160V" edc:when="(field &amp; 0xF) == 0x0C"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x0D" edc:desc="0.180V" edc:when="(field &amp; 0xF) == 0x0D"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x0E" edc:desc="0.200V" edc:when="(field &amp; 0xF) == 0x0E"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x0F" edc:desc="0.220V" edc:when="(field &amp; 0xF) == 0x0F"/>
              </edc:SFRFieldDef>
              <edc:SFRFieldDef edc:cname="DCDL" edc:nzwidth="0x4">
                <edc:SFRFieldSemantic edc:cname="VAL_0x00" edc:desc="0.050V" edc:when="(field &amp; 0xF) == 0x00"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x01" edc:desc="0.055V" edc:when="(field &amp; 0xF) == 0x01"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x02" edc:desc="0.060V" edc:when="(field &amp; 0xF) == 0x02"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x03" edc:desc="0.065V" edc:when="(field &amp; 0xF) == 0x03"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x04" edc:desc="0.070V" edc:when="(field &amp; 0xF) == 0x04"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x05" edc:desc="0.080V" edc:when="(field &amp; 0xF) == 0x05"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x06" edc:desc="0.090V" edc:when="(field &amp; 0xF) == 0x06"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x07" edc:desc="0.100V" edc:when="(field &amp; 0xF) == 0x07"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x08" edc:desc="0.110V" edc:when="(field &amp; 0xF) == 0x08"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x09" edc:desc="0.120V" edc:when="(field &amp; 0xF) == 0x09"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x0A" edc:desc="0.130V" edc:when="(field &amp; 0xF) == 0x0A"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x0B" edc:desc="0.140V" edc:when="(field &amp; 0xF) == 0x0B"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x0C" edc:desc="0.160V" edc:when="(field &amp; 0xF) == 0x0C"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x0D" edc:desc="0.180V" edc:when="(field &amp; 0xF) == 0x0D"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x0E" edc:desc="0.200V" edc:when="(field &amp; 0xF) == 0x0E"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x0F" edc:desc="0.220V" edc:when="(field &amp; 0xF) == 0x0F"/>
              </edc:SFRFieldDef>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xF6" edc:access="nnnnnnnn" edc:cname="CBPTR" edc:nzwidth="0x8" ltx:memberofperipheral="BATTERY_PROTECTION">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="OCPT" edc:nzwidth="0x4">
                <edc:SFRFieldSemantic edc:cname="VAL_0x00" edc:desc="1 ms" edc:when="(field &amp; 0xF) == 0x00"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x01" edc:desc="2 ms" edc:when="(field &amp; 0xF) == 0x01"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x02" edc:desc="4 ms" edc:when="(field &amp; 0xF) == 0x02"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x03" edc:desc="6 ms" edc:when="(field &amp; 0xF) == 0x03"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x04" edc:desc="8 ms" edc:when="(field &amp; 0xF) == 0x04"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x05" edc:desc="10 ms" edc:when="(field &amp; 0xF) == 0x05"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x06" edc:desc="12 ms" edc:when="(field &amp; 0xF) == 0x06"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x07" edc:desc="14 ms" edc:when="(field &amp; 0xF) == 0x07"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x08" edc:desc="16 ms" edc:when="(field &amp; 0xF) == 0x08"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x09" edc:desc="18 ms" edc:when="(field &amp; 0xF) == 0x09"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x0A" edc:desc="20 ms" edc:when="(field &amp; 0xF) == 0x0A"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x0B" edc:desc="22 ms" edc:when="(field &amp; 0xF) == 0x0B"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x0C" edc:desc="24 ms" edc:when="(field &amp; 0xF) == 0x0C"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x0D" edc:desc="26 ms" edc:when="(field &amp; 0xF) == 0x0D"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x0E" edc:desc="28 ms" edc:when="(field &amp; 0xF) == 0x0E"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x0F" edc:desc="30 ms" edc:when="(field &amp; 0xF) == 0x0F"/>
              </edc:SFRFieldDef>
              <edc:SFRFieldDef edc:cname="SCPT" edc:nzwidth="0x4">
                <edc:SFRFieldSemantic edc:cname="VAL_0x00" edc:desc="61 us" edc:when="(field &amp; 0xF) == 0x00"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x01" edc:desc="122 us" edc:when="(field &amp; 0xF) == 0x01"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x02" edc:desc="183 us" edc:when="(field &amp; 0xF) == 0x02"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x03" edc:desc="244 us" edc:when="(field &amp; 0xF) == 0x03"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x04" edc:desc="305 us" edc:when="(field &amp; 0xF) == 0x04"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x05" edc:desc="366 us" edc:when="(field &amp; 0xF) == 0x05"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x06" edc:desc="427 us" edc:when="(field &amp; 0xF) == 0x06"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x07" edc:desc="488 us" edc:when="(field &amp; 0xF) == 0x07"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x08" edc:desc="610 us" edc:when="(field &amp; 0xF) == 0x08"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x09" edc:desc="732 us" edc:when="(field &amp; 0xF) == 0x09"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x0A" edc:desc="854 us" edc:when="(field &amp; 0xF) == 0x0A"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x0B" edc:desc="976 us" edc:when="(field &amp; 0xF) == 0x0B"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x0C" edc:desc="1098 us" edc:when="(field &amp; 0xF) == 0x0C"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x0D" edc:desc="1220 us" edc:when="(field &amp; 0xF) == 0x0D"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x0E" edc:desc="1342 us" edc:when="(field &amp; 0xF) == 0x0E"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x0F" edc:desc="1464 us" edc:when="(field &amp; 0xF) == 0x0F"/>
              </edc:SFRFieldDef>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
